In [1]:
import pandas as pd
import psycopg2
import sqlalchemy

In [2]:
%load_ext sql

In [3]:
# Format %sql dialect+driver://username:password@host:port/database
%sql postgresql://postgres:password@localhost/postgres

In [4]:
%%sql

Create table If Not Exists Employee (Id int, Name varchar(255), Salary int, DepartmentId int);
Create table If Not Exists Department (Id int, Name varchar(255));
Truncate table Employee;
insert into Employee (Id, Name, Salary, DepartmentId) values ('1', 'Joe', '85000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('2', 'Henry', '80000', '2');
insert into Employee (Id, Name, Salary, DepartmentId) values ('3', 'Sam', '60000', '2');
insert into Employee (Id, Name, Salary, DepartmentId) values ('4', 'Max', '90000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('5', 'Janet', '69000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('6', 'Randy', '85000', '1');
insert into Employee (Id, Name, Salary, DepartmentId) values ('7', 'Will', '70000', '1');
Truncate table Department;
insert into Department (Id, Name) values ('1', 'IT');
insert into Department (Id, Name) values ('2', 'Sales');

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.

[]

In [5]:
%sql select  e.salary, e.departmentid, d.name as deptname from Employee e join Department d on e.departmentid = d.id

 * postgresql://postgres:***@localhost/postgres
7 rows affected.

[(85000, 1, 'IT'),
 (80000, 2, 'Sales'),
 (60000, 2, 'Sales'),
 (90000, 1, 'IT'),
 (69000, 1, 'IT'),
 (85000, 1, 'IT'),
 (70000, 1, 'IT')]

In [6]:
%%sql 

select * from Employee

 * postgresql://postgres:***@localhost/postgres
7 rows affected.

[(1, 'Joe', 85000, 1),
 (2, 'Henry', 80000, 2),
 (3, 'Sam', 60000, 2),
 (4, 'Max', 90000, 1),
 (5, 'Janet', 69000, 1),
 (6, 'Randy', 85000, 1),
 (7, 'Will', 70000, 1)]

In [7]:
%%sql 

select * from Department

 * postgresql://postgres:***@localhost/postgres
2 rows affected.

[(1, 'IT'), (2, 'Sales')]

In [8]:
%%sql 

select  e2.salary, e2.name from Employee e2
left join Employee e1 on e1.id <> e2.id where e2.salary = e1.salary

 * postgresql://postgres:***@localhost/postgres
2 rows affected.

[(85000, 'Joe'), (85000, 'Randy')]

In [10]:
%%sql

SELECT d.Name AS "Department",e1.Name AS "Employee", e1.Salary
FROM 
Employee e1
JOIN Department d on e1.DepartmentId = d.Id
WHERE 3 > (SELECT COUNT(DISTINCT e2.Salary) FROM Employee e2 
        WHERE e2.Salary > e1.Salary AND e1.DepartmentId = e2.DepartmentId);

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[('IT', 'Joe', 85000),
 ('Sales', 'Henry', 80000),
 ('Sales', 'Sam', 60000),
 ('IT', 'Max', 90000),
 ('IT', 'Randy', 85000),
 ('IT', 'Will', 70000)]

In [49]:
%%sql

SELECT e1.id,d.Name AS "Department",e1.Name AS "Employee", e1.Salary
FROM 
Employee e1
JOIN Department d on e1.DepartmentId = d.Id
WHERE 3 > (SELECT COUNT(e2.Salary) FROM Employee e2 
        WHERE e2.Salary > e1.Salary AND e1.DepartmentId = e2.DepartmentId)
AND 1 > (SELECT COUNT (e2.id) from Employee e2
        WHERE (e2.id > e1.id) AND (e2.Salary = e1.Salary) AND (e1.DepartmentId = e2.DepartmentId))
        order by d.Name,e1.Salary desc;

 * postgresql://postgres:***@localhost/postgres
4 rows affected.

[(4, 'IT', 'Max', 90000),
 (6, 'IT', 'Randy', 85000),
 (2, 'Sales', 'Henry', 80000),
 (3, 'Sales', 'Sam', 60000)]

In [53]:
%%sql

SELECT e1.id,d.Name AS "Department",e1.Name AS "Employee", e1.Salary
FROM 
Employee e1
JOIN Department d on e1.DepartmentId = d.Id
WHERE 2 > (SELECT COUNT(e2.id) from Employee e2 WHERE e2.id < e1.id and e1.DepartmentId = e2.DepartmentId)
order by d.Name,e1.id

 * postgresql://postgres:***@localhost/postgres
4 rows affected.

[(1, 'IT', 'Joe', 85000),
 (4, 'IT', 'Max', 90000),
 (2, 'Sales', 'Henry', 80000),
 (3, 'Sales', 'Sam', 60000)]

In [18]:
%%sql


select Department,Employee,Salary from (
select e.name as Employee,e.salary as Salary,d.name as Department, 
    dense_rank() over (partition by departmentId order by salary desc) as DeptPayRank 
    from Employee e join Department d on e.departmentid = d.id
) r where deptpayrank <= 3

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[('IT', 'Max', 90000),
 ('IT', 'Joe', 85000),
 ('IT', 'Randy', 85000),
 ('IT', 'Will', 70000),
 ('Sales', 'Henry', 80000),
 ('Sales', 'Sam', 60000)]